package me.hd.xiaoliurenplus.obj.desc

object 六亲Desc {
    val 信息 = mapOf(
        "父母" to """
            象意表现为严谨、正经、古板、内向、安静，善良、正义。
            代表文化学习，信息、文件、证件。
        """.trimIndent(),
        "兄弟" to """
            象意表现为义气、冲动、鲁莽、急切、不耐烦。
            代表、贪心、克财、索要、竞争、争斗、争执、合谋。
        """.trimIndent(),
        "子孙" to """
            象意表现为不严肃、任性、风流、逍遥、享乐、劳心、操劳。
            为福神，有消灾，解难，化解口舌是非之功能。
        """.trimIndent(),
        "妻财" to """
            象意表现为精力、精神、努力、勤快、现实、脚踏实地，重感情。
            代表钱财、资金、财产、财富等。
        """.trimIndent(),
        "官鬼" to """
            象意表现为怀疑、疑惑、有心机、老谋深算、心怀鬼胎、图谋不轨、阴险狡猾。
            代表权力、势力、权威、威望、名气、影响力等。
        """.trimIndent(),
    )
}