package me.hd.xiaoliurenplus.obj.data

object 地支Data {
    val 默认 = listOf("子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥")
    val 数据 = listOf(
        listOf(
            listOf("子", "寅", "辰", "午", "申", "戌"),
            listOf("戌", "子", "寅", "辰", "午", "申"),
            listOf("申", "戌", "子", "寅", "辰", "午"),
            listOf("午", "申", "戌", "子", "寅", "辰"),
            listOf("辰", "午", "申", "戌", "子", "寅"),
            listOf("寅", "辰", "午", "申", "戌", "子")
        ),
        listOf(
            listOf("丑", "卯", "巳", "未", "酉", "亥"),
            listOf("亥", "丑", "卯", "巳", "未", "酉"),
            listOf("酉", "亥", "丑", "卯", "巳", "未"),
            listOf("未", "酉", "亥", "丑", "卯", "巳"),
            listOf("巳", "未", "酉", "亥", "丑", "卯"),
            listOf("卯", "巳", "未", "酉", "亥", "丑")
        ),
        listOf(
            listOf("寅", "辰", "午", "申", "戌", "子"),
            listOf("子", "寅", "辰", "午", "申", "戌"),
            listOf("戌", "子", "寅", "辰", "午", "申"),
            listOf("申", "戌", "子", "寅", "辰", "午"),
            listOf("午", "申", "戌", "子", "寅", "辰"),
            listOf("辰", "午", "申", "戌", "子", "寅")
        ),
        listOf(
            listOf("卯", "巳", "未", "酉", "亥", "丑"),
            listOf("丑", "卯", "巳", "未", "酉", "亥"),
            listOf("亥", "丑", "卯", "巳", "未", "酉"),
            listOf("酉", "亥", "丑", "卯", "巳", "未"),
            listOf("未", "酉", "亥", "丑", "卯", "巳"),
            listOf("巳", "未", "酉", "亥", "丑", "卯")
        ),
        listOf(
            listOf("辰", "午", "申", "戌", "子", "寅"),
            listOf("寅", "辰", "午", "申", "戌", "子"),
            listOf("子", "寅", "辰", "午", "申", "戌"),
            listOf("戌", "子", "寅", "辰", "午", "申"),
            listOf("申", "戌", "子", "寅", "辰", "午"),
            listOf("午", "申", "戌", "子", "寅", "辰")
        ),
        listOf(
            listOf("巳", "未", "酉", "亥", "丑", "卯"),
            listOf("卯", "巳", "未", "酉", "亥", "丑"),
            listOf("丑", "卯", "巳", "未", "酉", "亥"),
            listOf("亥", "丑", "卯", "巳", "未", "酉"),
            listOf("酉", "亥", "丑", "卯", "巳", "未"),
            listOf("未", "酉", "亥", "丑", "卯", "巳")
        ),
        listOf(
            listOf("午", "申", "戌", "子", "寅", "辰"),
            listOf("辰", "午", "申", "戌", "子", "寅"),
            listOf("寅", "辰", "午", "申", "戌", "子"),
            listOf("子", "寅", "辰", "午", "申", "戌"),
            listOf("戌", "子", "寅", "辰", "午", "申"),
            listOf("申", "戌", "子", "寅", "辰", "午")
        ),
        listOf(
            listOf("未", "酉", "亥", "丑", "卯", "巳"),
            listOf("巳", "未", "酉", "亥", "丑", "卯"),
            listOf("卯", "巳", "未", "酉", "亥", "丑"),
            listOf("丑", "卯", "巳", "未", "酉", "亥"),
            listOf("亥", "丑", "卯", "巳", "未", "酉"),
            listOf("酉", "亥", "丑", "卯", "巳", "未")
        ),
        listOf(
            listOf("申", "戌", "子", "寅", "辰", "午"),
            listOf("午", "申", "戌", "子", "寅", "辰"),
            listOf("辰", "午", "申", "戌", "子", "寅"),
            listOf("寅", "辰", "午", "申", "戌", "子"),
            listOf("子", "寅", "辰", "午", "申", "戌"),
            listOf("戌", "子", "寅", "辰", "午", "申")
        ),
        listOf(
            listOf("酉", "亥", "丑", "卯", "巳", "未"),
            listOf("未", "酉", "亥", "丑", "卯", "巳"),
            listOf("巳", "未", "酉", "亥", "丑", "卯"),
            listOf("卯", "巳", "未", "酉", "亥", "丑"),
            listOf("丑", "卯", "巳", "未", "酉", "亥"),
            listOf("亥", "丑", "卯", "巳", "未", "酉")
        ),
        listOf(
            listOf("戌", "子", "寅", "辰", "午", "申"),
            listOf("申", "戌", "子", "寅", "辰", "午"),
            listOf("午", "申", "戌", "子", "寅", "辰"),
            listOf("辰", "午", "申", "戌", "子", "寅"),
            listOf("寅", "辰", "午", "申", "戌", "子"),
            listOf("子", "寅", "辰", "午", "申", "戌")
        ),
        listOf(
            listOf("亥", "丑", "卯", "巳", "未", "酉"),
            listOf("酉", "亥", "丑", "卯", "巳", "未"),
            listOf("未", "酉", "亥", "丑", "卯", "巳"),
            listOf("巳", "未", "酉", "亥", "丑", "卯"),
            listOf("卯", "巳", "未", "酉", "亥", "丑"),
            listOf("丑", "卯", "巳", "未", "酉", "亥")
        )
    )
}